Tekla Open API Reference for Tekla Structures 2025
ModelObjectVisualization.SetTransparency Method
Overload List
Name | Description
SetTransparency(List<Identifier>, TemporaryTransparency)
 Restores permanent representation settings and sets temporary transparency for given model object identifiers
SetTransparency(List<ModelObject>, TemporaryTransparency)
 Restores permanent representation settings and sets temporary transparency for given model objects
Top
See Also
Reference
ModelObjectVisualization Class
Tekla.Structures.Model.UI Namespace